#include <stdio.h>
#include <stdlib.h>

int main() {
  //    Определяем переменные и массив.
  int i, n, s;
  float A[n], f1, f2, f3;
  //    Ввод n с клавиатуры.
  printf(" Укажите размерность массива А[n], введя n с клавиатуры (n > 0): ");
  scanf("%d", &n);
  //    Вычисляем факториал (n)! (const).
  f1 = 1;
  for (i = 0, s = 0; i <= n; i++, s++) {
    if (i == 0) {
      i = 1;
    }
    f1 *= i;
    i = s; //    Возвращаем i значение s для дальнейшего цикла.
  }

  f2 = 1;
  for (i = 0, s = 0; i < n; i++, s++) {
    if (i == 0) {
      i = 1;
    }
    //    Вычисляем факториал f3.
    f2 *= i; //    Вычисляем факториал f2.
    i = s; //    Возвращаем i значение s во внешнем цикле.
    f3 = 1;
    for (; i <= n; i++) {
      if (i == n) {
        i = n - 1;
        f3 = f3 * (n - i);
        i = n;
      } else {
        f3 = f3 * (n - i);
      }
    }

    i = s; //    Возвращаем i значение s во внешнем цикле.

    A[i] = f1 /
           (f2 * f3); //    Формула нахождения значения элементов массива A[i].

    printf(" %.1f\n", A[i]);
  }
  system("pause");
}
